## Upload the CSV File for "bronze Layer" to Postgres sql using python to insert data into the table database

- Create a virtual Environment.
- Install the require library
- Open the Complete data warehouse pipeline project file where we have source crm and erp.

In [1]:
## Let import require library to read our dataset and connect to SQL postgress engine

import pandas as pd
import psycopg2
from sqlalchemy import create_engine, text

In [ ]:
## Let profiling by given the username and password our data by connecting postgres sql server

USERNAME ="postgres"
PASSWORD ="password"
HOST ="localhost"
PORT ="5432"
DB_NAME ="DataWarehouse"

#engine = create_engine(f"postgresql+psycopg2://{USERNAME}):{PASSWORD}@{HOST}:{PORT}/{DB_NAME}")

In [3]:
## Let create the engine from Sqlalchemy

from sqlalchemy import create_engine

engine = create_engine(
    "postgresql+psycopg2://postgres:postgres123@localhost:5432/DataWarehouse"
)

In [4]:
## let see the first postgress maybe it has coonect successfully

from sqlalchemy import text

with engine.connect() as conn:
    result = conn.execute(text("SELECT version();"))
    print(result.fetchone())

('PostgreSQL 15.2 on x86_64-apple-darwin20.6.0, compiled by Apple clang version 12.0.0 (clang-1200.0.32.29), 64-bit',)

### A. bronze.crm_cust_info

In [ ]:
## Let see & read the Pandas dataframe of dataset

df = pd.read_csv('/Users/user/Desktop/data_wareHouse_pipeline_project /source_crm/cust_info.csv')

In [ ]:
## Let see the first 5Row of our dataset

df.head(5)

,cust_id,cust_key,cust_firstname,cust_lastname,cust_marital_status,cust_gender,cust_create_date
0,11000.0,AW00011000,Jon,Yang,M,M,10/6/25
1,11001.0,AW00011001,Eugene,Huang,S,M,10/6/25
2,11002.0,AW00011002,Ruben,Torres,M,M,10/6/25
3,11003.0,AW00011003,Christy,Zhu,S,F,10/6/25
4,11004.0,AW00011004,Elizabeth,Johnson,S,F,10/6/25

In [ ]:
## Let connect the dataset to postgres SQl database

df.to_sql(
    name="crm_cust_info",
    con=engine,
    schema="bronze",
    if_exists="replace",
    index=False
)

494

In [ ]:
## Let test the connection server to our postgress data output was successful in postgres sql

with engine.connect() as conn:
    count = conn.execute(
        text("SELECT COUNT(*) FROM bronze.crm_cust_info;")
    ).scalar()

    print("Rows in postgres:", count)

    sample = conn.execute(
        text("SELECT * FROM bronze.crm_cust_info LIMIT 5;")
    ).fetchall()

    print("Sample data:", sample)

Rows in postgres: 18494
Sample data: [(11000.0, 'AW00011000', ' Jon', 'Yang ', 'M', 'M', '10/6/25'), (11001.0, 'AW00011001', 'Eugene', 'Huang  ', 'S', 'M', '10/6/25'), (11002.0, 'AW00011002', 'Ruben', ' Torres', 'M', 'M', '10/6/25'), (11003.0, 'AW00011003', 'Christy', '  Zhu', 'S', 'F', '10/6/25'), (11004.0, 'AW00011004', ' Elizabeth', 'Johnson', 'S', 'F', '10/6/25')]

### B. bronze.crm_prod_info

In [ ]:

df = pd.read_csv('/Users/user/Desktop/data_wareHouse_pipeline_project /source_crm/prod_info.csv')

In [ ]:
## Let see the first 5Row of our dataset

df.head(5)

,prod_id,prod_key,prod_name,prod_cost,prod_line,prod_start_date,prod_end_date
0,210,CO-RF-FR-R92B-58,HL Road Frame - Black- 58,NaN,R,7/1/03,NaN
1,211,CO-RF-FR-R92R-58,HL Road Frame - Red- 58,NaN,R,7/1/03,NaN
2,212,AC-HE-HL-U509-R,Sport-100 Helmet- Red,12.0,S,7/1/11,12/28/07
3,213,AC-HE-HL-U509-R,Sport-100 Helmet- Red,14.0,S,7/1/12,12/27/08
4,214,AC-HE-HL-U509-R,Sport-100 Helmet- Red,13.0,S,7/1/13,NaN

In [ ]:
## Let connect the dataset to postgres SQl database

df.to_sql(
    name="crm_prod_info",
    con=engine,
    schema="bronze",
    if_exists="replace",
    index=False
)

397

In [ ]:
## Let test the connection server to our postgress data output was successful in postgres sql

with engine.connect() as conn:
    count = conn.execute(
        text("SELECT COUNT(*) FROM bronze.crm_prod_info;")
    ).scalar()

    print("Rows in postgres:", count)

    sample = conn.execute(
        text("SELECT * FROM bronze.crm_prod_info LIMIT 5;")
    ).fetchall()

    print("Sample data:", sample)

Rows in postgres: 397
Sample data: [(210, 'CO-RF-FR-R92B-58', 'HL Road Frame - Black- 58', None, 'R ', '7/1/03', None), (211, 'CO-RF-FR-R92R-58', 'HL Road Frame - Red- 58', None, 'R ', '7/1/03', None), (212, 'AC-HE-HL-U509-R', 'Sport-100 Helmet- Red', 12.0, 'S ', '7/1/11', '12/28/07'), (213, 'AC-HE-HL-U509-R', 'Sport-100 Helmet- Red', 14.0, 'S ', '7/1/12', '12/27/08'), (214, 'AC-HE-HL-U509-R', 'Sport-100 Helmet- Red', 13.0, 'S ', '7/1/13', None)]

### C. bronze.crm_sales_details

In [ ]:
## Let see & read the Pandas dataframe of dataset

df = pd.read_csv('/Users/user/Desktop/data_wareHouse_pipeline_project /source_crm/sales_details.csv')

In [ ]:
## Let see the first 5Row of our dataset

df.head(5)

,sales_ord_num,sales_prod_key,sales_cust_id,sales_order_date,sales_ship_date,sales_due_date,sales_amount,sales_quantity,sales_price
0,SO43697,BK-R93R-62,21768,20101229,20110105,20110110,3578.0,1,3578.0
1,SO43698,BK-M82S-44,28389,20101229,20110105,20110110,3400.0,1,3400.0
2,SO43699,BK-M82S-44,25863,20101229,20110105,20110110,3400.0,1,3400.0
3,SO43700,BK-R50B-62,14501,20101229,20110105,20110110,699.0,1,699.0
4,SO43701,BK-M82S-44,11003,20101229,20110105,20110110,3400.0,1,3400.0

In [ ]:
## Let connect the dataset to postgres SQl database

df.to_sql(
    name="crm_sales_details",
    con=engine,
    schema="bronze",
    if_exists="replace",
    index=False
)

398

In [ ]:
## Let test the connection server to our postgress data output was successful in postgres sql

with engine.connect() as conn:
    count = conn.execute(
        text("SELECT COUNT(*) FROM bronze.crm_sales_details;")
    ).scalar()

    print("Rows in postgres:", count)

    sample = conn.execute(
        text("SELECT * FROM bronze.crm_sales_details LIMIT 5;")
    ).fetchall()

    print("Sample data:", sample)

Rows in postgres: 60398
Sample data: [('SO43697', 'BK-R93R-62', 21768, 20101229, 20110105, 20110110, 3578.0, 1, 3578.0), ('SO43698', 'BK-M82S-44', 28389, 20101229, 20110105, 20110110, 3400.0, 1, 3400.0), ('SO43699', 'BK-M82S-44', 25863, 20101229, 20110105, 20110110, 3400.0, 1, 3400.0), ('SO43700', 'BK-R50B-62', 14501, 20101229, 20110105, 20110110, 699.0, 1, 699.0), ('SO43701', 'BK-M82S-44', 11003, 20101229, 20110105, 20110110, 3400.0, 1, 3400.0)]

### D. bronze.erp_cust_az1

In [ ]:
## Let see & read the Pandas dataframe of dataset

df = pd.read_csv('/Users/user/Desktop/data_wareHouse_pipeline_project /source_erp/cust_az1.csv')

In [ ]:
## Let see the first 5Row of our dataset

df.head(5)

             cid birth_date  gender
0  NASAW00011000    10/6/71    Male
1  NASAW00011001    5/10/76    Male
2  NASAW00011002     2/9/71    Male
3  NASAW00011003    8/14/73  Female
4  NASAW00011004     8/5/79  Female

In [ ]:
## Let connect the dataset to postgres SQl database

df.to_sql(
    name="erp_cust_az1",
    con=engine,
    schema="bronze",
    if_exists="replace",
    index=False
)

484

In [ ]:
## Let test the connection server to our postgress data output was successful in postgres sql

with engine.connect() as conn:
    count = conn.execute(
        text("SELECT COUNT(*) FROM bronze.erp_cust_az1;")
    ).scalar()

    print("Rows in postgres:", count)

    sample = conn.execute(
        text("SELECT * FROM bronze.erp_cust_az1 LIMIT 5;")
    ).fetchall()

    print("Sample data:", sample)

Rows in postgres: 18484
Sample data: [('NASAW00011000', '10/6/71', 'Male'), ('NASAW00011001', '5/10/76', 'Male'), ('NASAW00011002', '2/9/71', 'Male'), ('NASAW00011003', '8/14/73', 'Female'), ('NASAW00011004', '8/5/79', 'Female')]

### E. bronze.erp_loc_a101

In [ ]:
## Let see & read the Pandas dataframe of dataset

df = pd.read_csv('/Users/user/Desktop/data_wareHouse_pipeline_project /source_erp/loc_a101.csv')

In [ ]:
## Let see the first 5Row of our dataset

df.head(5)

           cid    country
0  AW-00011000  Australia
1  AW-00011001  Australia
2  AW-00011002  Australia
3  AW-00011003  Australia
4  AW-00011004  Australia

In [ ]:
## Let connect the dataset to postgres SQl database

df.to_sql(
    name="erp_loc_a101",
    con=engine,
    schema="bronze",
    if_exists="replace",
    index=False
)

484

In [ ]:
## Let test the connection server to our postgress data output was successful in postgres sql


with engine.connect() as conn:
    count = conn.execute(
        text("SELECT COUNT(*) FROM bronze.erp_loc_a101;")
    ).scalar()

    print("Rows in postgres:", count)

    sample = conn.execute(
        text("SELECT * FROM bronze.erp_loc_a101 LIMIT 5;")
    ).fetchall()

    print("Sample data:", sample)

Rows in postgres: 18484
Sample data: [('AW-00011000', 'Australia'), ('AW-00011001', 'Australia'), ('AW-00011002', 'Australia'), ('AW-00011003', 'Australia'), ('AW-00011004', 'Australia')]

### F. bronze.erp_px_cat_g1v2

In [5]:
## Let see & read the Pandas dataframe of dataset

df = pd.read_csv('/Users/user/Desktop/data_wareHouse_pipeline_project /source_erp/px_cat_g1v2.csv')

In [6]:
## Let see the first 5Row of our dataset

df.head(5)

      id     category       sub_category maintenance
0  AC_BR  Accessories         Bike Racks         Yes
1  AC_BS  Accessories        Bike Stands          No
2  AC_BC  Accessories  Bottles and Cages          No
3  AC_CL  Accessories           Cleaners         Yes
4  AC_FE  Accessories            Fenders          No

In [7]:
## Let connect the dataset to postgres SQl database

df.to_sql(
    name="erp_px_cat_g1v2",
    con=engine,
    schema="bronze",
    if_exists="replace",
    index=False
)

37

In [8]:
## Let test the connection server to our postgress data output was successful in postgres sql


with engine.connect() as conn:
    count = conn.execute(
        text("SELECT COUNT(*) FROM bronze.erp_px_cat_g1v2;")
    ).scalar()

    print("Rows in postgres:", count)

    sample = conn.execute(
        text("SELECT * FROM bronze.erp_px_cat_g1v2 LIMIT 5;")
    ).fetchall()

    print("Sample data:", sample)

Rows in postgres: 37
Sample data: [('AC_BR', 'Accessories', 'Bike Racks', 'Yes'), ('AC_BS', 'Accessories', 'Bike Stands', 'No'), ('AC_BC', 'Accessories', 'Bottles and Cages', 'No'), ('AC_CL', 'Accessories', 'Cleaners', 'Yes'), ('AC_FE', 'Accessories', 'Fenders', 'No')]